FIO-tests-07-16-31-12-2020-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1609399033,
  "timestamp_ms" : 1609399033067,
  "time" : "Thu Dec 31 07:17:13 2020",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 740343808,
        "io_kbytes" : 722992,
        "bw_bytes" : 24677304,
        "bw" : 24098,
        "iops" : 6024.732509,
        "runtime" : 30001,
        "total_ios" : 180748,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 38554,
          "max" : 10781816,
          "mean" : 108808.879257,
          "stddev" : 127665.294441
        },
        "clat_ns" : {
          "min" : 2064,
          "max" : 12037478,
          "mean" : 54990.944807,
          "stddev" : 118465.901017,
          "percentile" : {
            "1.000000" : 2192,
            "5.000000" : 2224,
            "10.000000" : 2256,
            "20.000000" : 2288,
            "30.000000" : 2320,
            "40.000000" : 2352,
            "50.000000" : 2416,
            "60.000000" : 2640,
            "70.000000" : 127488,
            "80.000000" : 134144,
            "90.000000" : 175104,
            "95.000000" : 183296,
            "99.000000" : 220160,
            "99.500000" : 236544,
            "99.900000" : 366592,
            "99.950000" : 888832,
            "99.990000" : 4685824
          }
        },
        "lat_ns" : {
          "min" : 120848,
          "max" : 12079415,
          "mean" : 164288.131841,
          "stddev" : 152586.221228
        },
        "bw_min" : 14758,
        "bw_max" : 25697,
        "bw_agg" : 80.673690,
        "bw_mean" : 19440.745763,
        "bw_dev" : 1359.478394,
        "bw_samples" : 59,
        "iops_min" : 3689,
        "iops_max" : 6424,
        "iops_mean" : 4859.745763,
        "iops_stddev" : 339.867043,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.763333,
      "sys_cpu" : 68.126667,
      "ctx" : 62178,
      "majf" : 0,
      "minf" : 15,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 66.411247,
        "10" : 0.159891,
        "20" : 0.084648,
        "50" : 0.024343,
        "100" : 0.036515,
        "250" : 32.922633,
        "500" : 0.279948,
        "750" : 0.018811,
        "1000" : 0.017704
      },
      "latency_ms" : {
        "2" : 0.010512,
        "4" : 0.022130,
        "10" : 0.010000,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1871360000,
        "io_kbytes" : 1827500,
        "bw_bytes" : 62376587,
        "bw" : 60914,
        "iops" : 15228.659045,
        "runtime" : 30001,
        "total_ios" : 456875,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4284,
          "max" : 10674689,
          "mean" : 48549.955859,
          "stddev" : 93860.118800
        },
        "clat_ns" : {
          "min" : 4868,
          "max" : 11754754,
          "mean" : 475336.508430,
          "stddev" : 356419.166497,
          "percentile" : {
            "1.000000" : 90624,
            "5.000000" : 92672,
            "10.000000" : 193536,
            "20.000000" : 214016,
            "30.000000" : 317440,
            "40.000000" : 374784,
            "50.000000" : 464896,
            "60.000000" : 552960,
            "70.000000" : 585728,
            "80.000000" : 626688,
            "90.000000" : 749568,
            "95.000000" : 888832,
            "99.000000" : 1171456,
            "99.500000" : 1318912,
            "99.900000" : 5275648,
            "99.950000" : 6979584,
            "99.990000" : 10682368
          }
        },
        "lat_ns" : {
          "min" : 129787,
          "max" : 11760014,
          "mean" : 524259.999225,
          "stddev" : 350835.986557
        },
        "bw_min" : 40678,
        "bw_max" : 66904,
        "bw_agg" : 99.864132,
        "bw_mean" : 60831.237288,
        "bw_dev" : 5824.424747,
        "bw_samples" : 59,
        "iops_min" : 10169,
        "iops_max" : 16726,
        "iops_mean" : 15207.728814,
        "iops_stddev" : 1456.121689,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 5.740000,
      "sys_cpu" : 74.266667,
      "ctx" : 43762,
      "majf" : 0,
      "minf" : 22,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998468,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999781,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 7.084870,
        "250" : 17.117811,
        "500" : 30.392558,
        "750" : 35.360657,
        "1000" : 7.128646
      },
      "latency_ms" : {
        "2" : 2.609904,
        "4" : 0.159124,
        "10" : 0.130451,
        "20" : 0.015759,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 634768,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 101185,
      "write_ticks" : 0,
      "in_queue" : 410,
      "util" : 99.439892
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=295: Thu Dec 31 07:17:13 2020
  read: IOPS=6024, BW=23.5MiB/s (24.7MB/s)(706MiB/30001msec)
    slat (usec): min=38, max=10781, avg=108.81, stdev=127.67
    clat (usec): min=2, max=12037, avg=54.99, stdev=118.47
     lat (usec): min=120, max=12079, avg=164.29, stdev=152.59
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  128], 80.00th=[  135], 90.00th=[  176], 95.00th=[  184],
     | 99.00th=[  221], 99.50th=[  237], 99.90th=[  367], 99.95th=[  889],
     | 99.99th=[ 4686]
   bw (  KiB/s): min=14758, max=25697, per=80.67%, avg=19440.75, stdev=1359.48, samples=59
   iops        : min= 3689, max= 6424, avg=4859.75, stdev=339.87, samples=59
  lat (usec)   : 4=66.41%, 10=0.16%, 20=0.08%, 50=0.02%, 100=0.04%
  lat (usec)   : 250=32.92%, 500=0.28%, 750=0.02%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.01%, 20=0.01%
  cpu          : usr=3.76%, sys=68.13%, ctx=62178, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=180748,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=297: Thu Dec 31 07:17:13 2020
  read: IOPS=15.2k, BW=59.5MiB/s (62.4MB/s)(1785MiB/30001msec)
    slat (usec): min=4, max=10674, avg=48.55, stdev=93.86
    clat (usec): min=4, max=11754, avg=475.34, stdev=356.42
     lat (usec): min=129, max=11760, avg=524.26, stdev=350.84
    clat percentiles (usec):
     |  1.00th=[   91],  5.00th=[   93], 10.00th=[  194], 20.00th=[  215],
     | 30.00th=[  318], 40.00th=[  375], 50.00th=[  465], 60.00th=[  553],
     | 70.00th=[  586], 80.00th=[  627], 90.00th=[  750], 95.00th=[  889],
     | 99.00th=[ 1172], 99.50th=[ 1319], 99.90th=[ 5276], 99.95th=[ 6980],
     | 99.99th=[10683]
   bw (  KiB/s): min=40678, max=66904, per=99.86%, avg=60831.24, stdev=5824.42, samples=59
   iops        : min=10169, max=16726, avg=15207.73, stdev=1456.12, samples=59
  lat (usec)   : 10=0.01%, 100=7.08%, 250=17.12%, 500=30.39%, 750=35.36%
  lat (usec)   : 1000=7.13%
  lat (msec)   : 2=2.61%, 4=0.16%, 10=0.13%, 20=0.02%
  cpu          : usr=5.74%, sys=74.27%, ctx=43762, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=456875,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=23.5MiB/s (24.7MB/s), 23.5MiB/s-23.5MiB/s (24.7MB/s-24.7MB/s), io=706MiB (740MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=59.5MiB/s (62.4MB/s), 59.5MiB/s-59.5MiB/s (62.4MB/s-62.4MB/s), io=1785MiB (1871MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=634768/1, merge=0/0, ticks=101185/0, in_queue=410, util=99.44%